{
  "reviews": [
    {
      "author": "Nina Gregory",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp776_hQPOckcWWnrZub1or3-OebPA_IrrYBaURM=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "James and Harley from Newline Painting were extremely friendly and accommodating and left us very happy. Their attention to detail was exceptional and I couldn't recommend Newline Painting more highly. We had the exterior painted, not the interior but in hindsight, we should have used them for the lot!"
    },
    {
      "author": "Connor Anderson",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCnjY_Haf4lZ_VWcIs4Ywuu5wCyjsmerGfvDRLUf=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "John and his team did a brilliant job painting our apartment. Excellent communication and great to work with, we would absolutely book Newline again."
    },
    {
      "author": "Thomas Goodyear",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCko24d-9jrYNYzm4n7ZWv7CVxvdVb1lRaAj2bvf=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Newline Painting did an excellent job at my place. The team arrived on time each day and completed the job in the time frame promised. Their team worked hard and finished the final touch-ups as well. I wouldn't hesitate to recommend them. House is looking lovely and smells new again!"
    },
    {
      "author": "Emma Cross",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCmpX-CsStYjQETrs_lnHp2DKBzXDInwu21z4menJw=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "We recently had Newline Painting led by Sam and his team. They painted both the inside and outside of our Home in St. Kilda. We initially had Sam come to paint only our inside Ceilings and under our outside eves and fascia but on arrival we decided that we would look at painting all of the inside rooms as well. This wasn't a problem for Sam and he quickly adapted by bringing in another 2 of his team. I must say that we haven't been disappointed. They were at all times prompt by arriving at 7.30am each morning. Their workmanship, friendliness and professionalism is second to none."
    },
    {
      "author": "Kieran Warren",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp6ASzZwQImKAFcfBtrDzrgGx8aF_6jcuQC2umuJ=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "I would highly recommend the effective and efficient painting services delivered by Newline Painting and their team of professionals. They completed the interior and exterior painting of my executive home at an exceptional standard and at a very affordable price. I am very pleased with the quality of their service. It was flawless and they certainly exceeded my expectations on all fronts. The painting was very neat, thorough and above average. Daniel and his team were also enthusiastic on the job!"
    },
    {
      "author": "Derek Stevenson",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp7wapkvDmEBCpQCy2_yVrUtBw2jMdss1WHuHlpqJQ=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "I am very happy with the service Newline provided from start to finish. They were quick to respond, provided a same day quote and completed the job in the agreed timeframe. The team showed up on time everyday, worked hard and even did a fantastic job of packing up. Special thanks for fixing up the bathroom ceiling!"
    },
    {
      "author": "Juan Witherspoon",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCmG70MUSIOsQcaiv1YWW7ksSVZ6h5ktrBD4C-ebzw=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Daniel and his team have just completed a painting job for me - outside of our house plus a 40m rendered boundary fence with our neighbour. Daniel did a professional job and I am very pleased with the outcome. He is reliable, trustworthy, reasonably priced, and prides himself on a good job. I would recommend Daniel and Newline for any paint job you have. -Julia"
    },
    {
      "author": "Eve Wong",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp7SXpck63VnyyCepoA6yHOvPVYOyMOiTU7T6WaW=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Phi got back to me quickly after putting in an inquiry and was able to book in an appointment for a quote quickly. Newline Painting's price was good value compared to other quotes. He was able to book in the job within the week and finished the job ahead of schedule. The painting was neat and tidy and the crew kept the place clean. Highly recommended!"
    },
    {
      "author": "Niamh Houghton",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp6xX0_oWVArUG_V69SRnwTeFazC3CeyubX1S0tT=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "James and his team from Newline Painting were excellent. Our two-storey home looks so fresh and we couldn't be happier. Great service received and we highly recommend them for all your painting needs."
    },
    {
      "author": "Libby Dunn",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WClqkpfcTHdGF99PL-T_InOQ6kKP69egg6jGewDU=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Great work from Newline Painting! They are very professional and without a doubt I would use John and his team again. Very quick and easy to work with!"
    },
    {
      "author": "Christine Bailey",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5Hj92bm-APCr-iqWhqq4HvGVtqtqce76LgZ6gu=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Fantastic work from Sam and his team, they complete the full exterior house paint within the estimated timescale and the new paint scheme is wonderful."
    },
    {
      "author": "Lucy Neales",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCnooTRlmz2RNrOLaxYAVpzDzVkQV-dXKHt2ouYcfQ=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Sam at Newline Painting did a fantastic job on our property, we were impressed with his quality and speed. He even went above and beyond to move some substantial objects that I wasn't able to move before he started. Would definitely recommend him!"
    },
    {
      "author": "Kieran butcher",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp7hlghixzWj5n-_6-sOOhQw8Yyu0TvRp4ituBMhgA=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "George and his team from Newline patched and then painted throughout my 3 bed apartment after some major renovations and did a fantastic job. They then came back at short notice some time later to do some remedial work after I had to make unexpected changes, and fitted in with my ever changing schedule. Always a quality and clean job, very friendly and helpful too."
    },
    {
      "author": "Bernie Martinez",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCnMV1E02wNMKBYmxCohBDXvz2KMUqF72Mj-SGKiQQ=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Daniel and the team have done a wonderful job of repainting our studio. We have rendered their painting services on numerous occasions for internal and external painting over the last ten years and have always been very impressed with his service, value for money and his friendly approach along with his staff. I can highly recommend him to any business or residential client who is looking for quality work."
    },
    {
      "author": "Lachlan Pawsey",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCmRzCxRG-p2D_SOgRBpYDx1rbLS6Hkyb--zs2y5=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Great experience with George and Newline. Personable professional and did a great job on a tight deadline. We really appreciated how responsive and flexible they were and the finish is perfect. Very happy, use it with absolute confidence. (Fixed up and painted 2-bed apartment)"
    },
    {
      "author": "Laura George",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCmg1oqEDqIp0EKt-hoJLONS-k4iICNjGAvt7FX-Nw=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "James have been the most efficient and responsive tradie I have come across in Melbourne. Super fast with arriving for quotes and and sending them out. Arrives on time and with his team does the job to a high standard at a reasonable price. Always courteous and patient, James was always prepared to listen and meet expectations. An old school decent guy, I would highly recommend."
    },
    {
      "author": "Wilford Griffin",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5wmABlY7fIWOrQbGnFud4R4SDOvsPF_xi1Z-wR=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "We had an extremely difficult painting job that they helped us with. We found them to be very professional and easy to communicate with. We would definitely recommend their services to anyone and we will use them again in the near future. Thanks for everything you did for us."
    },
    {
      "author": "Carolyn Kendrick",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp6PC7T25TgKyZdWhvpLC3GL7ctLOwk65D9Y-Lv8=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Daniel's professionalism and his attention to detail were excellent. His team were efficient and courteous and turned up on time and cleaned up at the end of each day. We had a number of rooms that required wallpaper to be removed and then the walls and ceilings painted and this was all done well. Any issues that we raised Daniel was happy to address and I can highly recommend their service."
    },
    {
      "author": "Cameron Frost",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp4ZWx1f9slgpJLBQLYIjl9863y13HUASVU0mEAM=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Professional team, amazing quality and value. John's communication and attention to detail - not to mention ingenious problem solving - was outstanding, everything ran smoothly from quote to completion and the care they took with their work and respect with which they treated everything else was exemplary. They are a lovely team to deal with personally and the quality of their work is second to none.  I cannot recommend them enough."
    },
    {
      "author": "Zara Buckley",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp53rejwdVGTVCDV9hvU9SZhVw9wozJZ1rdJP_WN=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Sam and his team transformed our seriously dated flat into a fresh, clean and rentable asset. Couldn't be more helpful and patient with me. I can highly recommend Sam and his team. 5 stars well deserved 👍"
    },
    {
      "author": "Robert Mason",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp53rwCJ8sPq8RjvMZf8c43OhefXZbEzP1QW_sg3=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "I cannot say enough great things about John and his team. From getting a quote to getting started and finishing to the highest standards - we are thrilled with the result. They care about the detail, are patient with last minute client changes and genuinely want you to get the best result possible. Can't wait to work with them again."
    },
    {
      "author": "Elise Forster",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCk3KvTPYVpzhqz2lv0Rdy4xWGShsvwmAMUVFFQD=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Our painter on the day, Daniel, was a pleasure to deal with and really nice. The job looks great! Really appreciate how fast, quality and responsive Newline was at a reasonable price."
    },
    {
      "author": "Gregory Buckley",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp4v-AdF6O7r4A1kz5Xey88tQNPrW3Bo6qU-jZCA=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "2 years ago",
      "content": "Asked around for a small job in the house. Sam was quick to reply and arrange something to happen within my constraints."
    },
    {
      "author": "Disco Elysium",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5YrWwJi3GiPF-5LFckwNpF70O_V16ybC6blKQ3=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "3 years ago",
      "content": "John's quality of workmanship is second to none.  He pays attention to the minutest of details and even did the extras most painters wouldn't bother with.  I'd give Newline 6 stars if I could. My partner and I are extremely happy with the painting of our house.  Thank you so much for a fantastic job, highly recommend!"
    },
    {
      "author": "Ray Tian",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WClGF0aMVP0997Z9xRsa4axqwUk3rcfyLxBcDCR_WQ=s120-c-c0x00000000-cc-rp-mo-s56-ba3-br100",
      "rating": 5,
      "date": "3 years ago",
      "content": "Excellent workmanship, Johnny and Phi are very helpful, too! Easy to deal with, will use your service again!"
    },
    {
      "author": "Drew Malcolm",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp7GRrYl-Ud4YOo93kIUhkfpHGR3YlMQ8mD3OK8d=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "3 years ago",
      "content": "Really happy with the work that was done at my home. Jason and Harley were awesome to work with. Nothing was ever too hard for them. Couldn't recommend Newlkne Painting highly enough."
    },
    {
      "author": "Kim Dang",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5-wJoLrM5W6-51JHJyQpl2DJ9WYB-IBHHBDg3-=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "3 years ago",
      "content": "I've had lots of previous issues with my bathroom ceiling peeling and showing up gross marks and have had to have it repainted several times.Newline sent John out to have a look and recommend a solution. John was very informative and educated me on what he was doing, why he was doing it and gave advice on how to maintain the paintwork so that I wouldn't have issues going forward. John also helped with a bunch of odd jobs around the house while he was here and really went the extra mile. On top of that, he was great entertainment!100% recommend Newline and John 😊"
    },
    {
      "author": "karina horton",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCnbCariY1e6duBiuO8DX4REDVH26GmkkrTKr_-vBw=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "3 years ago",
      "content": "John was absolutely amazing! Not only at painting but he was such a good person, he became apart of the family in the short 2 weeks of knowing him. Steve was also amazing. John worked so hard and did things for us he didn't need to do and we loved him to bits! He is the best"
    },
    {
      "author": "Peter Rijs",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5QYXNr7-vwjPITNKpcPzar_oqm9MQoscCpn61e=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "4 years ago",
      "content": "We had a bath tub repainted. We contacted 3 trades Newline responded in a timely matter. The job was completed with no fuss and Newline fitted the work in to be completed on time. We have another 2 bath tubs  to repair and we will be contacting Newline to complete these too."
    },
    {
      "author": "wan lunna",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp4NRFZyw4HW_4vSz0k9nEWYCXKEKSW_dG0UPTv8=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "4 years ago",
      "content": "Newline Painting was great from the moment I contacted them.I got in touch with Daniel and they walked me through the whole process of how their painting process works.Daniel explained to me what paints should be used for which surface and suggested a colour scheme that I ended up using for the interior walls and architraves of my home.They painted all the rooms, kitchen, bathrooms and our newly constructed living room extension. They repainted all the eaves on the outside too.I would highly recommend Newline Painting and will be using them again for future projects."
    },
    {
      "author": "Phi Dang",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp7XWWSin13CTQPdav1VYQ6VPKOTG8AGMtfxkMuC=s120-c-c0x00000000-cc-rp-mo-s56-ba2-br100",
      "rating": 5,
      "date": "4 years ago",
      "content": "Newline Painting is an excellent company to work with and outstanding service. Highly recommended for interior and exterior painting and for any painting advice."
    },
    {
      "author": "Alan Tran",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5iAevDubU8AFC_wDOJz6I04tBK7mksUsRXcXHb=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "4 years ago",
      "content": ""
    },
    {
      "author": "David James",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5FygpIDaseTOSzC-i8Ys-bxbEZvvbDN8iZRDAF=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "4 years ago",
      "content": "I needed my Melbourne house interior painted and found Daniel & Dave at Newline to be very professional painters. They respected my budget and carried out a quality interior painting job well within time. Its hard to trust a lot of tradesmen these days but these guys have restored my faith!"
    },
    {
      "author": "Jan Thyssen",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WClWaxXQ4puKioAAEfvc9sY_OJ0tCjPi3LMhpEpSBA=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "4 years ago",
      "content": "Prompt responses to email, great work, easy to book"
    },
    {
      "author": "Scott Mitchelmore",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WClA4DTyMpophu-3EgZdhuBv09omwDF-qVav8AAH=s120-c-c0x00000000-cc-rp-mo-s56-ba6-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "I needed my Melbourne house interior painted and found Daniel & Dave at Newline to be very professional painters. They respected my budget and carried out a quality interior painting job well within time. Its hard to trust a lot of tradesmen these days but these guys have restored my faith!"
    },
    {
      "author": "Harry Cann",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WClA4DTyMpophu-3EgZdhuBv09omwDF-qVav8AAH=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "Top treatment of our home from the guys at Newline. Very happy with the results of the newly painted walls. The wife is pleased and so is the rest of the family, thank you!!"
    },
    {
      "author": "Jay N",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WClCcpRbKj3Daqkk9QDsmq__inBD3cdOhef8VjG1Pw=s120-c-c0x00000000-cc-rp-mo-s56-ba3-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "Thank you Newline Painting for the fantastic work! The house looks new as ever with the newly painted rooms. Very professional and top quality! I would highly recommend them for all your interior house painting!"
    },
    {
      "author": "Mark Andre",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCnjG3sqhmy18JBY1R7COyCytVEupXmzejIcM3yxhA=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "Absolutely wonderful work. The guys were extremely professional, and helpful. Great job - they are really masters at what they do. We love the colors - our home looks beautiful. Thank you so much!"
    },
    {
      "author": "Henry Telford",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCkQ7ezui9BmJU3VShhnt3WgPA0_NrxvKC407TK5=s120-c-c0x00000000-cc-rp-mo-s56-ba2-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "Newline exceeded our expectations at every turn. They were originally referred to them by close friends and from beginning to end were attentive, delicate with our property and professional in the way they managed themselves. Couldn't have asked for a better team! Henry."
    },
    {
      "author": "Daniel Law",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCnRO6dbcdhe0eJDQHMSqtIrVNm7W4uJubvipAeY8Ag=s120-c-c0x00000000-cc-rp-mo-s56-ba4-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "The guys at Newline Painting did a great job repainting our investment property. We were updated every step of the way and were very happy with the level of communication and professionalism shown. Props to the team for their excellent service. Thanks again"
    },
    {
      "author": "Anna Pascuzzo",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp67eB7nS3YwA-QbdgTeQf5Z7wGONaEiqe7vZeYr=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "We had painted our rental place amazing work thank you newline painting"
    },
    {
      "author": "Jess McDavies",
      "avatar": "https://lh3.googleusercontent.com/a/AEdFTp5JUh1h0Zhvj39rxCEjgfJm1p69_Fmd4cNqEA8=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "We recently had Newline Painting paint our kids' bedrooms and our hallway. I used their online quote which came out to be competitively priced compared to two other quotes I received, and we ended up choosing Newline Painting from the great service over the phone.The paint went really smoothly and was completed in three days. The end result looks better than we were expecting, and we are extremely impressed with their work.Thank you for your work. High recommended!"
    },
    {
      "author": "Julie McIntyre",
      "avatar": "https://lh3.googleusercontent.com/a-/AD5-WCm0bcRY19AMZpJ49RgKTIJ574cg4Bnb4dTIidXW=s120-c-c0x00000000-cc-rp-mo-s56-br100",
      "rating": 5,
      "date": "7 years ago",
      "content": "I have had Newline Painting out twice to paint exterior and interior areas of my home in Williamstown. Both times they have done an excellent job and charged a fair price. Daniel and Dave are easy to work with and they do meticulous work.Thanks guys!"
    }
  ],
  "links": {
    "all_reviews": "https://search.google.com/local/reviews?placeid=ChIJt3chYvI_1moRrTV7QW3pSiA",
    "write_review": "javascript:void(0)"
  }
}